// вивести на екран ялинку такого розміру, який вказує користувач

//   *
//  ***
// *****
//   *
// вивести на екран зірку яка буде по центру і з боків будуть відступи
// далі вивести на екран 2 зірки у яких буде одинаква(тобто завжди повинна залишатись парна кількість) відстань з боківно
// повторюват розширючи середину доки не зникнуть відступи
// знову пункт 1.


let userCristmasTree =  +prompt("Enter what size of cristmas tree you want! ");
//
for (let i = 0; i <  userCristmasTree; i++) {
  // запускаємо першу ітерацію, і менше = 10, опускаємось в нижчий цикл.//
  for (let a = userCristmasTree; a > i; a--) {
    /*     заходимо  в цей цикл, в якому а = 10 і воно менше і = 0, поки a більще за i буде додатись пробіл, після кожної прокрутки а буде зменшуватись на 1, пробіли також будуть зменшуватись. тут ми добавляэмо пробіли від більшої кількості  до меншої. */
    console.put(" ");

  }
  // 2. тепер нам потрібно додати зірочки, які будуть йти до збільшення в низ
  for (let b = 0; b < i; b++) {
    /* Поки b менше i, i кожного разу збільшуєтся, що дає нам можливість кожного разу додавати на одну зірку більше.*/
      console.put("*");
  }
  // 3. Потрібно надрукувати другу частину ялинки. Як?? Продублюємо? Чому тоді воно так друкує? Певно, рахує закінчення старих елементів початком.
  for (let c = 0; c <= i; c++) {
    /* Поки b менше i, i кожного разу збільшуєтся, що дає нам можливість кожного разу додавати на одну зірку більше.*/
      console.put("*");
  }
  console.put("\n");
/*   після кожної ітерції першого циклу, буде додаватись перенос тексту на іншу лінію, та цикл буде запускатись знову поки і не стане дорівнвати userCristmasTree
 */
}
// 4 - Виводимо стовбур
/* Потрібно знову додати пробіли, та відразу після них додати одну зіку: */
for (let d = 0; d < userCristmasTree; d++) {
  console.put(' ');
  
}
console.put('*');