let userNumber = +prompt('Enter your number!');
let i = 0;
while ( i <= userNumber) { // Коли і менше дорівнює 10
    i++; // i збільшуєтся на 1 при кожній ітерації(виконання циклу у фігурних скобках, буде виконуватись поки і не буде таким як ЮзерНамбер)
    if (i % 2 == 0){ // тут ми перевіряємо якою буде остача від ділення на 2
        console.put(i); // виводимо у консль число І яке не має залишку після ділленя (тобто після коми ПУСТО!)
        if (i == userNumber) break; //порівнюємо і до введеного числа користувачем, якщо вони рівні тоді зупиняємо цикл!
        console.put(',');//виводимо коми кожного разу коли всі умови вище виконуются
    }
}






